#include <iostream>
using namespace std;

int main() {
	cout << "欢迎使用御风工作室教程" << endl;
	/* 二维数组定义的四种方式：
	   1.数据类型  数组名[行数][列数]
	   2.数据类型  数组名[行数][列数] = { { 数据1,数据2 },{ 数据3,数据4 } }; 
	   3.数据类型  数组名[行数][列数] = { 数据1,数据2,数据3,数据4 }; 
	   4.数据类型  数组名[][列数] = { 数据1,数据2,数据3,数据4 }; */

	// 方式1：数据类型  数组名[行数][列数]
	int arr1[2][3]; // 定义一个2行3列的二维数组
	arr1[0][0] = 1; // 给第1行第1列赋值
	arr1[0][1] = 2; // 给第1行第2列赋值
	arr1[0][2] = 3; // 给第1行第3列赋值
	arr1[1][0] = 4; // 给第2行第1列赋值
	arr1[1][1] = 5; // 给第2行第2列赋值
	arr1[1][2] = 6; // 给第2行第3列赋值

	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			cout << arr1[i][j] << " "; // 输出二维数组的元素
		}
		cout << endl; // 换行
	}

	// 方式2：数据类型  数组名[行数][列数] = { { 数据1,数据2 },{ 数据3,数据4 } };
	int arr2[2][3] = { { 1, 2, 3 }, { 4, 5, 6 } }; // 定义并初始化一个2行3列的二维数组
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			cout << arr2[i][j] << " "; // 输出二维数组的元素
		}
		cout << endl; // 换行
	}

	// 方式3：数据类型  数组名[行数][列数] = { 数据1,数据2,数据3,数据4 };
	int arr3[2][3] = { 1, 2, 3, 4, 5, 6 }; // 定义并初始化一个2行3列的二维数组
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			cout << arr3[i][j] << " "; // 输出二维数组的元素
		}
		cout << endl; // 换行
	}

	// 方式4：数据类型  数组名[][列数] = { 数据1,数据2,数据3,数据4 };
	int arr4[][3] = { 1, 2, 3, 4, 5, 6 }; // 定义并初始化一个2行3列的二维数组
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			cout << arr4[i][j] << " "; // 输出二维数组的元素
		}
		cout << endl; // 换行
	}

	system("pause");
	return 0;
}